app/controllers/events_controller.rb

  def index
    @events = current_user.events.order(created_at: :desc)
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1 ORDER BY "events"."created_at" DESC  [["user_id", 6]]